app/views/users/show.html.erb

SELECT COUNT(*) FROM "attendees" WHERE "attendees"."event_id" = $1  [["event_id", 1]]
---
            <h4>Looking for: <%=  %></h4>
            <h4>Down: <%= event.attendees.count %></h4>