app/views/events/index.html.erb

            <h4>Looking for: <%=  %></h4>
            <h4>Down: <%= event.attendees.count %></h4>
---
SELECT COUNT(*) FROM "attendees" WHERE "attendees"."event_id" = $1  [["event_id", 2]]