app/views/events/show.html.erb


<% attending = current_user.attendees.select{ |attendee| attendee.event_id == @event.id } %>
---
SELECT "attendees".* FROM "attendees" WHERE "attendees"."user_id" = $1  [["user_id", 1]]