app/controllers/attendees_controller.rb

INSERT INTO "attendees" ("created_at", "event_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sun, 23 Feb 2014 02:46:20 UTC +00:00], ["event_id", 1], ["updated_at", Sun, 23 Feb 2014 02:46:20 UTC +00:00], ["user_id", 1]]
---
  def create
    @attendee = Attendee.new
    @attendee.user_id = current_user.id
    @attendee.event_id = params[:event_id]

    if @attendee.save