app/controllers/events_controller.rb

INSERT INTO "events" ("address", "created_at", "creator_id", "date", "deets", "latitude", "longitude", "time", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @event = Event.new(event_params)
    @event.date = @event.date.change({
      hour: params[:time][0..1].to_i,
      min: params[:time][3..4].to_i })
    @event.creator_id = current_user.id

    if @event.save