app/controllers/users_controller.rb

  def show
    @events = Event.where(:creator_id => current_user.id)
---
SELECT "events".* FROM "events" WHERE "events"."creator_id" = 1